export const Chalets = [
  {
    id: 1,
    name: "شاليه البحر الأحمر 1",
    title: "شاليه رقم 1 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 1 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 1 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    img: "/assets/images/chalet-img.png",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
  },
  {
    id: 2,
    name: "شاليه البحر الأحمر 2",
    title: "شاليه رقم 2 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 2 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 2 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 3,
    name: "شاليه البحر الأحمر 3",
    title: "شاليه رقم 3 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 3 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 3 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 4,
    name: "شاليه البحر الأحمر 4",
    title: "شاليه رقم 4 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 4 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 4 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 5,
    name: "شاليه البحر الأحمر 5",
    title: "شاليه رقم 5 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 5 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 5 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 6,
    name: "شاليه البحر الأحمر 6",
    title: "شاليه رقم 6 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 6 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 6 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 7,
    name: "شاليه البحر الأحمر 7",
    title: "شاليه رقم 7 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 7 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 7 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 8,
    name: "شاليه البحر الأحمر 8",
    title: "شاليه رقم 8 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 8 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 8 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
  {
    id: 9,
    name: "شاليه البحر الأحمر 9",
    title: "شاليه رقم 9 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 9 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 9 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
      "/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "/assets/images/chalet-img.png",
  },
];

export const Packages = [
  {
    id: 1,
    name: "المجانية",
    chaletName: "شامله البحر",
    startDate: "01-11-2024",
    endDate: "01-12-2024",
  },
  {
    id: 2,
    name: "المميزة",
    chaletName: "شامله الجبال",
    startDate: "01-11-2024",
    endDate: "01-12-2024",
  },
  {
    id: 3,
    name: "الاحترافيه",
    chaletName: "شامله الزهور",
    startDate: "01-11-2024",
    endDate: "01-12-2024",
  },
];

export const Posts = [
  {
    id: 1,
    title: "فضل الوجهات الشاطئية لعام 2024",
    description:
      "اكتشف أشهر الوجهات الشاطئية لهذا العام، مع أروع المناظر الطبيعية وأجمل الشواطئ التي تأخذك بعيدًا عن ضغوط الحياة. خطط لعطلتك القادمة مع دليل شامل لأفضل الأماكن التي تستحق الزيارة",
    image: "/assets/images/posts/Image.png",
  },
  {
    id: 2,
    title: "فضل الوجهات الشاطئية لعام 2024",
    description:
      "اكتشف أشهر الوجهات الشاطئية لهذا العام، مع أروع المناظر الطبيعية وأجمل الشواطئ التي تأخذك بعيدًا عن ضغوط الحياة. خطط لعطلتك القادمة مع دليل شامل لأفضل الأماكن التي تستحق الزيارة",
    image: "/assets/images/posts/1c0a1e09e501ab6338ad9f5f8b40d96f.jpg",
  },
  {
    id: 3,
    title: "أفضل وقت لحجز الشاليهات بأسعار مخفضة",
    description:
      "الحصول على عروض مميزة لحجز الشاليهات يتطلب معرفة أوقات التخفيضات. اكتشف أسرار الحصول على أفضل الأسعار، وأهم النصائح لتوفير المال أثناء التخطيط لإجازتك القادمة",
    image: "/assets/images/posts/96bef5681c9997d3f2a48bce81054e26.jpg",
  },
  {
    id: 4,
    title: "لماذا يجب عليك الحجز أونلاين؟",
    description:
      "لحجز عبر الإنترنت يمنحك المرونة والراحة مع خيارات واسعة تناسب جميع احتياجاتك. تعرف على كيف يمكنك الاستفادة من هذه الخدمة بطريقة آمنة وسريعة مع مقارنة الأسعار والعروض بسهولة.",
    image: "/assets/images/posts/3063786a4187a5ed0032efe67b99e644.jpg",
  },
  {
    id: 5,
    title: "لماذا يجب عليك الحجز أونلاين؟",
    description:
      "لحجز عبر الإنترنت يمنحك المرونة والراحة مع خيارات واسعة تناسب جميع احتياجاتك. تعرف على كيف يمكنك الاستفادة من هذه الخدمة بطريقة آمنة وسريعة مع مقارنة الأسعار والعروض بسهولة.",
    image: "/assets/images/posts/fff14dedee481445d87a3b95fa1ea1e4.png",
  },
  {
    id: 6,
    title: "أفضل الطرق لقضاء وقت ممتع مع أصدقائك",
    description:
      "اجعل عطلتك مليئة بالذكريات السعيدة مع مجموعة من الأنشطة المرحة التي يمكنكم القيام بها معًا. اكتشف كيفية استغلال كل لحظة في أجواء مميزة وممتعة تناسب جميع الأعمار",
    image: "/assets/images/posts/4b13f01d482ae0ba889b8e745e80e926.jpg",
  },
];

export const Plans = [
  {
    id: 1,
    title: "المجانية",
    price: "مجانا",
    features: ["دخول لوحة المالك", "دعم تقني 24/7", "15 حجوزات شهريًا"],
  },
  {
    id: 2,
    title: "المميزة",
    price: "600 ريال / شهر",
    features: [
      "دخول لوحة المالك",
      "دعم تقني 24/7",
      "30 حجوزات شهريًا",
      "أولوية في دعم العملاء",
    ],
  },
  {
    id: 3,
    title: "الاحترافية",
    price: "1200 ريال / شهر",
    features: [
      "دخول لوحة المالك",
      "دعم تقني 24/7",
      "حجوزات غير محدودة شهريًا",
      "أولوية في دعم العملاء",
      "تحليل شخصي عبر حساب مخصص",
      "تقارير أسبوعية مع استشارات متخصصة",
    ],
  },
];


export const Bookings = [
  {
      id: "12345",
      clientName: " محمد فتحي ",
      chaletName: "شاليه الزهور",
      phone: "01094976357",
      bookingDate: "01-12-2024",
      departureDate: "07-12-2024",
      amount: "1500",
      status: "مؤكد",
      statusColor: "bg-[#48BB78]", // اللون الخاص بالحالة
  },
  {
      id: "12346",
      clientName: " محمد فتحي ",
      chaletName: "شاليه الجبل",
      phone: "01094976357",
      bookingDate: "02-12-2024",
      departureDate: "08-12-2024",
      amount: "2000",
      status: "قيد المراجعة",
      statusColor: "bg-[#ECC94B]",
  },
  {
      id: "12347",
      clientName: " محمد فتحي ",
      chaletName: "شاليه البحر",
      phone: "01094976357",
      bookingDate: "03-12-2024",
      departureDate: "09-12-2024",
      amount: "4000",
      status: "ملغي",
      statusColor: "bg-[#FF0000]",
  },
  {
      id: "12348",
      clientName: " محمد فتحي ",
      chaletName: "شاليه الزهور",
      phone: "01094976357",
      bookingDate: "01-12-2024",
      departureDate: "07-12-2024",
      amount: "1500",
      status: "مؤكد",
      statusColor: "bg-[#48BB78]", // اللون الخاص بالحالة
  },
  {
      id: "12349",
      clientName: " محمد فتحي ",
      chaletName: "شاليه الجبل",
      phone: "01094976357",
      bookingDate: "02-12-2024",
      departureDate: "08-12-2024",
      amount: "2000",
      status: "قيد المراجعة",
      statusColor: "bg-[#ECC94B]",
  },
  {
      id: "12351",
      clientName: " محمد فتحي ",
      chaletName: "شاليه البحر",
      phone: "01094976357",
      bookingDate: "03-12-2024",
      departureDate: "09-12-2024",
      amount: "4000",
      status: "ملغي",
      statusColor: "bg-[#FF0000]",
  },
];

export const backendUrl = import.meta.env.VITE_URL_BACKEND;
